if User.find_by(email: "admin@admin.com").nil?
    User.create!(
        name:  "admin_user",
        email: "admin@admin.com",
        password:              "admin98",
        password_confirmation: "admin98",
        admin: true
    )
end

if Area.find_by(name: '北海道').nil?
    Area.create!(
        [
            {name: '北海道'},
            {name: '東北'},
            {name: '関東'},
            {name: '中部'},
            {name: '関西'},
            {name: '中国'},
            {name: '四国'},
            {name: '九州・沖縄'}
        ]
    )
end
    Tag.create!(
        [
            {name: '自然'},
            {name: '歴史'},
            {name: '体験'},
            {name: '舞台'},
        ]
    )

Event.create!(
  [{name: '青い池', article: 'この池は1988年12月に噴火した十勝岳の堆積物による火山泥流災害を防ぐため、美瑛川本流に複数建設された堰堤のひとつに水が溜まったものである。
この堰堤はコンクリートブロックによるもので、北海道開発局により1989年6月に着工され同年年末に完成した。美瑛川を横切る形で施工され、本流から離れた両岸の森林内部まで堰堤が造られた結果、',
    image:open("./public/aoiike.jpg"),
    prefecture: '北海道', city: '上川郡美瑛町白金', street: '1-1',
    area_id: 1},
    {name: '積丹半島', article: '積丹半島は北海道西部、後志総合振興局にある半島である。地名の由来はアイヌ語のシャク・コタン（夏の村）である。日本海に向かって突き出ており、地質学上では那須火山帯に属する後志火山群の延長上に位置する。半島部の全長は約30km、地形は平野部が少なく急峻で、中心では積丹岳や余別岳が脊梁をなし、沿岸は複雑な海岸線が連続する。そのため、風光明媚な景観に富み、海岸線一帯はニセコ積丹小樽海岸国定公園に指定されている。',
    image:open("./public/積丹半島.jpg"),
    prefecture: '北海道', city:'積丹町大字野塚町', street:'212-1',
    area_id: 1},
    {name: 'ファーム富田', article: 'ファーム富田は、北海道空知郡中富良野町にある農園。主にラベンダーを中心とした花を呼び物に、春から秋にかけて開園する。園内にはドライフラワーを使用した土産屋や資料館も位置しており、営業時間内は入園無料である。所在地は北海道空知郡中富良野町北星。',
    image:open("./public/ファーム富田.jpg"),
    prefecture: '北海道', city:'中富良野町', street:'基線北15号',
    area_id: 1},
    {name: '札幌市時計台', article: '札幌市時計台は、北海道札幌市中央区北1条西2丁目にある歴史的建造物である。重要文化財。 正式名称を「旧札幌農学校演武場」と称する。現在の通称は「札幌時計台」、もしくは単に「時計台」と呼ばれ、たくさんの観光人が訪れる名所になった。',
    image:open("./public/札幌市時計台.jpg"),
    prefecture: '北海道', city:'札幌市', street:'中央区北1条西2丁目',
    area_id: 1},

    {name: '弘前城', article: '弘前城は、陸奥国鼻和郡弘前にあった日本の城である。別名・鷹岡城、高岡城。江戸時代に建造された天守や櫓などが現存し国の重要文化財に指定されている。また城跡は国の史跡に指定されている。江戸時代には津軽氏が居城し弘前藩の藩庁が置かれた。',
    image:open("./public/弘前城.jpg"),
    prefecture: '青森県', city: '弘前市', street: '大字下白銀町1',
    area_id: 2},
    {name: '奥入瀬渓流', article: '奥入瀬渓流は、青森県十和田市の十和田湖東岸の子ノ口から北東に、焼山までの約14kmにわたる奥入瀬川の渓流である。十和田八幡平国立公園に属する。国指定の特別名勝及び天然記念物。',
    image:open("./public/奥入瀬渓流.jpg"),
    prefecture: '青森県', city:'十和田市', street:'大字奥瀬60',
    area_id: 2},
    {name: '弘前城公園', article: '弘前公園は、青森県弘前市にある公園。別名は、鷹揚公園、鷹揚園。弘前市都市公園条例での名称は「鷹揚園」。 春には約50種、2,600本の桜が咲く名所としても知られる。',
    image:open("./public/弘前城公園.jpg"),
    prefecture: '青森県', city:'弘前市', street:'大字下白銀町1',
    area_id: 2},

    {name: '中尊寺', article: '中尊寺は、岩手県西磐井郡平泉町にある天台宗東北大本山の寺院。奥州三十三観音番外札所。山号は関山、本尊は釈迦如来 。寺伝では円仁の開山とされる。実質的な開基は藤原清衡。 奥州藤原氏三代ゆかりの寺として著名であり、平安時代の美術、工芸、建築の粋を集めた金色堂を始め、多くの文化財を有する。',
    image:open("./public/中尊寺.jpg"),
    prefecture: '岩手県', city: '西磐井郡平泉町', street: '平泉衣関202',
    area_id: 2},
    {name: '浄土ヶ浜', article: '浄土ヶ浜は、岩手県宮古市にある海岸。国の名勝に指定されている。三陸復興国立公園に属し、三陸を代表する景勝地の1つである。',
    image:open("./public/浄土ヶ浜.jpg"),
    prefecture: '岩手県', city:'宮古市', street:'日立浜町32',
    area_id: 2},
    {name: '龍泉洞', article: '龍泉洞は、日本の岩手県下閉伊郡岩泉町にある鍾乳洞。岩泉湧窟とも言う。総延長約1,200m。高低差約249mは日本の洞窟中第5位。 秋芳洞・龍河洞と共に「日本三大鍾乳洞」の一つに数えられる。 また、地底湖は龍泉洞地底湖の水として1985年名水百選のひとつに選定された。',
    image:open("./public/龍泉洞.jpg"),
    prefecture: '岩手県', city:'下閉伊郡岩泉町', street:'岩泉神成1番地1',
    area_id: 2},


    {name: '仙台城', article: '仙台城は、現在の宮城県仙台市青葉区の青葉山にあった日本の城である。雅称は「青葉城」で「五城楼」の別名もある。 国の史跡。',
    image:open("./public/仙台城.jpg"),
    prefecture: '宮城県', city: '仙台市', street: '青葉区川内1',
    area_id: 2},
    {name: '蔵王の御釜', article: '御釜は、宮城県刈田郡蔵王町と同県柴田郡川崎町の境界付近にある火口湖で、五色沼とも呼ばれる。蔵王連峰の中央部の最も標高の高いエリアにあり、しばしば蔵王連峰の象徴として見られている。宮城県と山形県の県境から至近であり、宮城県のみならず山形県の名所としても紹介される。',
    image:open("./public/蔵王の御釜.jpg"),
    prefecture: '宮城県', city:'刈田郡蔵王町', street:'遠刈田温泉倉石岳国有地内国有林内',
    area_id: 2},
    {name: '仙台うみの杜水族館', article: '仙台うみの杜水族館は、宮城県仙台市宮城野区高砂中央公園内に所在する民間水族館である。横浜八景島と仙台水族館開発が連携して運営を行う。',
    image:open("./public/仙台うみの杜水族館.jpg"),
    prefecture: '宮城県', city:'仙台市', street:'宮城野区中野4丁目6',
    area_id: 2},

    {name: '千秋公園', article: '千秋公園は、秋田県秋田市にある都市公園である。',
    image:open("./public/千秋公園.jpg"),
    prefecture: '秋田県', city: '秋田市', street: '千秋公園1',
    area_id: 2}
  ]
)
